'''
문제 13: 피보나치 수열 (재귀 없이)

n번째 피보나치 수를 반환하는 함수를 작성하시오.
단, 재귀는 사용하지 않고 반복문으로만 구현하세요.
'''

############## 주의 ##############
# 입력을 받기위한 input 함수는 절대 사용하지 않습니다.

def fibonacci():
    # 여기에 코드를 작성하세요.
    pass

# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우 
# 모든 책임은 삭제한 본인에게 있습니다. 
############## 테스트 코드 삭제 금지 #################
print(fibonacci(0))   # 0
print(fibonacci(1))   # 1
print(fibonacci(5))   # 5
print(fibonacci(10))  # 55
#####################################################