'''
문제 9: 리스트 요소의 평균 구하기 (내장 함수 금지)

정수 리스트의 평균을 구하는 함수를 작성하시오. (sum(), len() 사용 금지)
'''

############## 주의 ##############
# 입력을 받기위한 input 함수는 절대 사용하지 않습니다.

def calculate_average():
    # 여기에 코드를 작성하세요.
    pass

# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우 
# 모든 책임은 삭제한 본인에게 있습니다. 
############## 테스트 코드 삭제 금지 #################
print(calculate_average([10, 20, 30, 40]))  # 25.0
#####################################################