'''
문제 14: 두 리스트의 교집합 (중복 제거)

두 개의 리스트에서 중복 없이 교집합 요소만 반환하는 함수를 작성하시오.
'''

############## 주의 ##############
# 입력을 받기위한 input 함수는 절대 사용하지 않습니다.

def intersection():
    # 여기에 코드를 작성하세요.
    pass

# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우 
# 모든 책임은 삭제한 본인에게 있습니다. 
############## 테스트 코드 삭제 금지 #################
print(intersection([1, 2, 2, 3], [2, 3, 4]))       # [2, 3]
print(intersection([5, 6, 7], [7, 8, 9]))          # [7]
print(intersection([1, 2, 3], [4, 5, 6]))          # []
#####################################################